ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ПередачаМатериаловВПроизводство/ПередачаМатериаловВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05de6b57-2c1e-4021-854e-7055bdc9ec36">
  <name>ПередачаМатериаловВПроизводство</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ИТБК_ТехническийДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="edd19de3-13a9-485d-bcbf-cd0cd0584c96">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ab620618-b96d-449c-ab8e-7d12c0fc6ed8">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="c5badd7e-02ff-40e6-9286-45b5ad2fa287">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="88f9b1e4-fd23-4b06-9184-6ee355400c63">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="06772c21-eb6c-47af-a336-eec64f49f5f0">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bc3a0e61-7760-4bd3-9ab1-dd166fc6467f">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d59a9f62-153a-481d-bab6-3f178d0606f1">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6d7cf2e-b9f9-4ff3-8578-9b565c26699e">
    <name>ДоверенностьНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6067ffa5-2788-47af-b233-3eaecb858e38">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3e7b9be-3656-4800-8e46-0709bd569743">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8b5edf9d-182d-49ae-acc0-af59ac327193">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="05936dfd-7396-410f-88bf-a2c6c4adf099">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/АктВыполненныхРабот/АктВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2275b5d-ab87-483e-b252-2de5d94fc643">
  <name>АктВыполненныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f6fff40a-9eb3-48a4-9315-d7d344822d1e">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="384081c8-6346-45c3-940a-7e0deebba07d">
    <name>Услуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5c8ec2d7-20d0-48c4-8230-5de9b798846a">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1caf232-2691-4775-b844-f1e6767b45cd">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c4ec43ac-9064-4733-b80a-3da57ddcf3c9">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ac314f88-3e25-4a93-b8d7-717c2b98b5e0">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/CommonModules/МодификацияКонфигурацииПереопределяемый/Module.bsl
&После("ПриСозданииНаСервере")
Процедура vs_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	Элементы = Форма.Элементы;
	Если Форма.ИмяФормы	= "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда  // begin fix Designer08.09.2020 15:02:59
		Форма.Элементы.НомерВходящегоДокумента.Заголовок = "Счет поставщика";
		//СтруктураОтбора = Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОплатаПоДоговоруБезСчета_0a8b9b3ad54541998932dc50d98ccd96"));
		//ИскомыеСтроки = Форма.Объект.ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора);
		//Если ИскомыеСтроки.Количество()
		//	и ИскомыеСтроки[0].Значение Тогда
		//Иначе
		//	Форма.Элементы.НомерВходящегоДокумента.АвтоОтметкаНезаполненного = Истина;	
		//	Форма.Элементы.ДатаВходящегоДокумента.АвтоОтметкаНезаполненного = Истина;
		//КонецЕсли;
		//Форма.Элементы.ГруппаЗаказПоДаннымПоставщика.Видимость = Ложь;
		Если Форма.Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы.Количество() Тогда
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаЗаказПоДаннымПоставщика, Форма.Элементы.ГруппаДополнительныеРеквизиты, Форма.Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы[Форма.Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы[0].Имя]);
		иначе
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаЗаказПоДаннымПоставщика, Форма.Элементы.ГруппаДополнительныеРеквизиты);
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		Форма.Элементы.НомерПоДаннымКлиента.Заголовок = "Счет на оплату";
	ИначеЕсли Форма.ИмяФормы	= "Документ.ПередачаМатериаловВПроизводство.Форма.ФормаДокумента" Тогда
		НовыйЭлемент = Форма.Элементы.Вставить("ИТБК_ТехническийДокумент", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительно, Форма.Элементы.ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.Заголовок = "Технический документ (Мат.Отчет)";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.ИТБК_ТехническийДокумент";
		
		Форма.ТолькоПросмотр = Форма.Объект.ИТБК_ТехническийДокумент;
		Форма.Элементы.Статус.Видимость = Не Форма.Объект.ИТБК_ТехническийДокумент;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ВнутреннееПотребление.Форма.ФормаДокумента" Тогда
		Если (Форма.Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			или Форма.Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию)
			и Форма.Элементы.ТоварыСтатьяРасходов.Видимость 
			и Форма.Элементы.ТоварыСтатьяРасходов.Доступность 
			и Форма.Элементы.Найти("vs_СтатьяРасходов") = Неопределено Тогда
			
			Элементы = Форма.Элементы;
			
			НовыйЭлемент = Элементы.Вставить("vs_СтатьяРасходов", Тип("ПолеФормы"), Элементы.ГруппаТовары, Элементы.Товары);
			НовыйЭлемент.Заголовок 				= 	"Статья расходов/активов (vssoft)";
			НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 			= "Объект.vs_СтатьяРасходов";
			//НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			//НовыйЭлемент.МаксимальнаяШирина 	= 28;
			//НовыйЭлемент.КнопкаВыпадающегоСписка= Истина;
			НовыйЭлемент.КнопкаВыбора           = Истина;
			НовыйЭлемент.КнопкаОткрытия			= Истина;
			НовыйЭлемент.Установитьдействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
			
			//Элементы.ТоварыСтатьяРасходов.Видимость = Ложь;
			Элементы.ТоварыСтатьяРасходов.Доступность = Ложь;
			Элементы.ТоварыСтатьяРасходов.Ширина		= 1;
			Элементы.ТоварыСтатьяРасходов.ОтображатьВШапке = Ложь;
			Элементы.ТоварыСтатьяРасходов.ОтображатьВПодвале = Ложь;
			Элементы.ТоварыСтатьяРасходов.АвтоМаксимальнаяШирина = Ложь;
			Элементы.ТоварыСтатьяРасходов.Заголовок = ".";
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента" Тогда
		//Команды
		НоваяКоманда = Форма.Команды.Добавить("vs_ЗаполнитьСчетНаОплату");
		НоваяКоманда.Действие = "vs_ЗаполнитьСчетНаОплату";	
		
		//НоваяГруппа = Форма.Элементы.Добавить("РасшифровкаПлатежаvsГруппаКнопкиаполнитьСчетНаОплату",Тип("ГруппаФормы"), Форма.Элементы.РасшифровкаБезРазбиения);
		НоваяКнопка = Форма.Элементы.Добавить("РасшифровкаПлатежаvs_ЗаполнитьСчетНаОплату", Тип("КнопкаФормы"), Форма.Элементы.РасшифровкаБезРазбиения);
		НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	    НоваяКнопка.ИмяКоманды = "vs_ЗаполнитьСчетНаОплату";
		НоваяКнопка.Заголовок = "Заполнить счет на оплату";
		
		Форма.Элементы.Переместить(НоваяКнопка, Форма.Элементы.РасшифровкаБезРазбиения, Форма.Элементы.РасшифровкаБезРазбиения.ПодчиненныеЭлементы.РасшифровкаБезРазбиенияКомментарий);
		
		НоваяКнопка = Форма.Элементы.Добавить("РасшифровкаПлатежаvs_ЗаполнитьСчетНаОплату1",Тип("КнопкаФормы"), Форма.Элементы.РасшифровкаПлатежа.КоманднаяПанель);
		НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	    НоваяКнопка.ИмяКоманды = "vs_ЗаполнитьСчетНаОплату";
		НоваяКнопка.Заголовок = "Заполнить счет на оплату";
		
		//Если Форма.Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
		//	НоваяКнопка.Доступность=Ложь;
		//КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента" Тогда
		Статус = Форма.Объект.Статус;
		СВ = Элементы.Статус.СписокВыбора;
		Элементы.Статус.РежимВыбораИзСписка = Истина;
		СВ.Очистить();
		Если Не РольДоступна("ПолныеПрава") и Не РольДоступна("vs_ПравоИзмененияСтатусаКоммерческогоПредложенияКлиенту")
			и (Статус = Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует) Тогда
			СВ.Добавить(Форма.Объект.Статус);
			Элементы.Статус.Доступность = Ложь;
		ИначеЕсли Не РольДоступна("ПолныеПрава") и Не РольДоступна("vs_ПравоИзмененияСтатусаКоммерческогоПредложенияКлиенту") Тогда
			СВ.Добавить(Форма.Объект.Статус);
			Если СВ.НайтиПоЗначению(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик) = Неопределено Тогда
				СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик);
			КонецЕсли;
			Если СВ.НайтиПоЗначению(Перечисления.СтатусыКоммерческихПредложенийКлиентам.НеСогласовано) = Неопределено Тогда
				СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.НеСогласовано);
			КонецЕсли;
		Иначе
			СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик);
			СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.НеСогласовано);
            СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует);
			СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Отменено);
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.СчетФактураВыданный.Форма.ФормаДокумента" Тогда
		Форма.Элементы.ПредставлениеНомера.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");	
		//Форма.Элементы.ПредставлениеНомера.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьКомандуНаСервере");
	ИначеЕсли Форма.ИмяФормы	= "Документ.СчетФактураВыданныйАванс.Форма.ФормаДокументаРФ" Тогда
		НовыйЭлемент = Элементы.Вставить("ПредставлениеНомера", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво, Элементы.Корректировочный);
		НовыйЭлемент.Заголовок 				= 	"Номер на печать (vssoft)";
		НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 			= "Объект.ПредставлениеНомера";
		НовыйЭлемент.Установитьдействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");	
		Элементы.Номер.Установитьдействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		
	ИначеЕсли Форма.ИмяФормы	= "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		Форма.Элементы.Номер.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		//Форма.Команды.РеквизитыПечати.УстановитьДействие("Нажатие", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		Форма.Команды.РеквизитыПечати.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	ИначеЕсли Форма.ИмяФормы	= "Документ.АктВыполненныхРабот.Форма.ФормаДокумента" Тогда
		Форма.Элементы.Номер.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");  // end fix Designer08.09.2020 15:03:03
	ИначеЕсли Форма.ИмяФормы	= "Отчет.vs_МатериальныйОтчет.Форма" Тогда  // begin fix Designer 14.06.2024 15:02:59 
		Если РольДоступна("ПолныеПрава") или РольДоступна("vs_ОтражениеМатериальногоОтчета") Тогда
			//Реквизиты
			МассивДобавляемыхРеквизитов = Новый Массив;
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("vs_ФормироватьДокументы",
				Новый ОписаниеТипов("Булево")));
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			//Команды
			НоваяКоманда = Форма.Команды.Добавить("vs_ОтразитьМатериальныйОтчет");
			//НоваяКоманда.Действие = "Подключаемый_Команда";	
			НоваяКоманда.Действие = "ОтчетСкомпоноватьРезультат";	
		    //Кнопка
			НоваяКнопка = Элементы.Добавить("vs_Отразить",Тип("КнопкаФормы"), Элементы.ГруппаГлавное);
			НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		    НоваяКнопка.ИмяКоманды = "vs_ОтразитьМатериальныйОтчет";
			НоваяКнопка.Заголовок = "Отразить в учете";
            НоваяКнопка.ЦветФона = ЦветаСтиля.ВыделеннаяКнопкаФон;
			НоваяКнопка.ЦветТекста = ЦветаСтиля.ПодтверждениеОперацииОписаниеЦвет;
		
		КонецЕсли;	
	КонецЕсли;                                                                   
КонецПроцедуры

&После("ПриЧтенииНаСервере")
Процедура vs_ПриЧтенииНаСервере(Форма, ТекущийОбъект)                            // begin fix Designer27.10.2020 1:57:46
	Если Форма.ИмяФормы	= "Документ.ПередачаМатериаловВПроизводство.Форма.ФормаДокумента" Тогда
		Форма.ТолькоПросмотр = ТекущийОбъект.ИТБК_ТехническийДокумент;
		Форма.Элементы.Статус.Видимость = Не Форма.Объект.ИТБК_ТехническийДокумент;
	КонецЕсли;                                                                   // end fix Designer27.10.2020 1:57:39
КонецПроцедуры
